app/views/projects/show.html.slim

table.table
  -@project.tasks.each do |task|
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."project_id" = ?  [["project_id", 1]]

table.table
  -@project.tags.each do |tag|
---
SELECT "tags".* FROM "tags" INNER JOIN "project_tags" ON "tags"."id" = "project_tags"."tag_id" WHERE "project_tags"."project_id" = ?  [["project_id", 1]]