app/controllers/projects_controller.rb

INSERT INTO "projects" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "first"], ["created_at", 2017-03-27 17:14:35 UTC], ["updated_at", 2017-03-27 17:14:35 UTC]]
---
  def create
    @project = Project.new(project_params)

    respond_to do |format|
      if @project.save

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def update
    @project = Project.find(params[:id])